# LoadCaseOrCombinationId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadComponent..::..LoadCaseOrCombinationId Property
LoadComponent Class See Also
---
Load case or combination id.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId LoadCaseOrCombinationId { get; set; }
```

Visual Basic
---
```text
Public Property LoadCaseOrCombinationId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LoadCaseOrCombinationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace